In [7]:
import pandas

student1 = pandas.Series({'국어':100, '영어':80, '수학':90})
student1 = student1 + 50
student1 += 1
student1 -= [1, 2, 3]
student1

국어    150
영어    129
수학    138
dtype: int64

In [16]:
# 시리즈 + 값       : 시리즈의 모든 원소에 동일한 값으로 연산
# 시리즈 + 목록     : 시리즈의 나열된 순서대로 목록의 원소들로 연산
# 시리즈1 + 시리즈2 : 시리즈의 나열된 순서와 상관없이 같은 index끼리 연산
#                     시리즈1과 시리즈2에 서로 없는 index끼리의 연산 결과는 NaN
student1 = pandas.Series({'국어':100, '영어':80, '수학':90, '체육':80})
student2 = pandas.Series({'수학': 80, '국어':90, '영어':80, '음악':70})
print(student1 + student2)
print()
print(student1.add(student2, fill_value = 0))

국어    190.0
수학    170.0
영어    160.0
음악      NaN
체육      NaN
dtype: float64

국어    190.0
수학    170.0
영어    160.0
음악     70.0
체육     80.0
dtype: float64

In [43]:
import seaborn

titanic = seaborn.load_dataset('titanic')
df1 = titanic[['age', 'fare']].head()
df2 = titanic.loc[1:5, ['age', 'fare']]
df2['new'] = [1, 2, 3, 4, 5]
df1 + df2

    age      fare  new
0   NaN       NaN  NaN
1  76.0  142.5666  NaN
2  52.0   15.8500  NaN
3  70.0  106.2000  NaN
4  70.0   16.1000  NaN
5   NaN       NaN  NaN

In [45]:
df1.add(df2, fill_value = 0)

    age      fare  new
0  22.0    7.2500  NaN
1  76.0  142.5666  1.0
2  52.0   15.8500  2.0
3  70.0  106.2000  3.0
4  70.0   16.1000  4.0
5   NaN    8.4583  5.0